/**
 ****************************************************************************************************
 * @file        version.h
 * @author      md
 * @version     V1.0
 * @date        2025-12-01
 * @brief       项目版本管理头文件
 * @license     Copyright (c)  
 ****************************************************************************************************
 * @attention
 * 版本管理规范：
 * - 主版本号 (例如：1.0.0)

 * 修改说明
 * V1.0 20251201 - 第一次发布
 *
 ****************************************************************************************************
 */

#ifndef __VERSION_H
#define __VERSION_H

/* 版本信息定义 */
#define VERSION      "1.0.0" // 版本字符串

/* 项目信息 */
#define PROJECT_NAME        "ele_control"
#define PROJECT_AUTHOR      "md"
#define PROJECT_DATE        "2025-12-01"


#endif /* __VERSION_H */
